micropython/micropython/duo/libs/H_platform/MCU/STM32F2xx/STM32_StdPeriph_Driver/inc/stm32f2xx_i2c.h
          - When to use
             - This function is suitable for the same applications above but it
               allows to overcome the mentioned limitation of I2C_GetFlagStatus()
               function.
             - The returned value could be compared to events already defined in
               this file or to custom values defined by user.
               This function is suitable when multiple flags are monitored at the
               same time.
             - At the opposite of I2C_CheckEvent() function, this function allows
               user to choose when an event is accepted (when all events flags are
               set and no other flags are set or just when the needed flags are set
               like I2C_CheckEvent() function.

          - Limitations
             - User may need to define his own events.
             - Same remark concerning the error management is applicable for this
               function if user decides to check only regular communication flags
               (and ignores error flags).


     3. Flag-based state monitoring (Using the function I2C_GetFlagStatus())
     -----------------------------------------------------------------------

      Using the function I2C_GetFlagStatus() which simply returns the status of
      one single flag (ie. I2C_FLAG_RXNE ...).

          - When to use
             - This function could be used for specific applications or in debug
               phase.
             - It is suitable when only one flag checking is needed (most I2C
               events are monitored through multiple flags).
          - Limitations:
             - When calling this function, the Status register is accessed.
               Some flags are cleared when the status register is accessed.
               So checking the status of one Flag, may clear other ones.
             - Function may need to be called twice or more in order to monitor
               one single event.
 */

/*
 ===============================================================================
                          1. Basic state monitoring
 ===============================================================================
 */
ErrorStatus I2C_CheckEvent(I2C_TypeDef* I2Cx, uint32_t I2C_EVENT);
/*
 ===============================================================================
                          2. Advanced state monitoring
 ===============================================================================
 */
uint32_t I2C_GetLastEvent(I2C_TypeDef* I2Cx);
/*
 ===============================================================================
                          3. Flag-based state monitoring
 ===============================================================================
 */
FlagStatus I2C_GetFlagStatus(I2C_TypeDef* I2Cx, uint32_t I2C_FLAG);


void I2C_ClearFlag(I2C_TypeDef* I2Cx, uint32_t I2C_FLAG);
ITStatus I2C_GetITStatus(I2C_TypeDef* I2Cx, uint32_t I2C_IT);
void I2C_ClearITPendingBit(I2C_TypeDef* I2Cx, uint32_t I2C_IT);

#ifdef __cplusplus
}
#endif

#endif /*__STM32F2xx_I2C_H */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
